# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, BottleneckCSP, [128, 128]]  # Replace C2f with BottleneckCSP
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, BottleneckCSP, [256, 256 ]]  # Replace ResNetLayer with BottleneckCSP
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 1, BottleneckCSP, [512, 512]]  # Replace ResNetLayer with BottleneckCSP
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, BottleneckCSP, [1024, 1024]]  # Replace ResNetLayer with BottleneckCSP
  - [-1, 1, SPPF, [1024, 5]]  # 10 SPPF (Spatial Pyramid Pooling)

# YOLOv10 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, BottleneckCSP, [512,512]]  # Replace C2f with BottleneckCSP
  - [-1, 1, EMA, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, BottleneckCSP, [256,256]]  # Replace C2f with BottleneckCSP
  - [-1, 1, EMA, [128]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, BottleneckCSP, [512,512]]  # Replace C2f with BottleneckCSP
  - [-1, 1, EMA, [256]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, BottleneckCSP, [1024,1024]]  # Replace C2fCIB with BottleneckCSP
  - [-1, 1, EMA, [512]]

  - [[16, 20, 24], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)
