head:
  # Applying SEBlock after C3Ghost for refining fine-grained features
  - [-1, 1, EMA, [1024]] # Applying EMA to emphasize important features (P5 level)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsampling from P5 to P4
  - [[-1, 7], 1, Concat, [1]] # Concatenate backbone P4 features
  - [-1, 3, C2f, [512]] # Feature extraction using C3Ghost at P4 level
  - [-1, 1, SEBlock, [256]] # Applying SEBlock for fine-grained channel-wise recalibration at P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsampling from P4 to P3
  - [[-1, 4], 1, Concat, [1]] # Concatenate backbone P3 features
  - [-1, 3, C2f, [256]] # Feature extraction using C3Ghost at P3 level (P3/8-small)
  - [-1, 1, SEBlock, [128]] # Applying SEBlock for fine-grained channel-wise recalibration at P3

  - [-1, 1, Conv, [256, 3, 2]] # Downsample to P4 level
  - [[-1, 15], 1, Concat, [1]] # Concatenate head P4 features
  - [-1, 3, C2f, [512]] # Feature extraction using C3Ghost at P4 level (P4/16-medium)
  - [-1, 1, EMA, [512]] # Applying EMA to emphasize prominent features at P4

  - [-1, 1, SCDown, [512, 3, 2]] # Downsample to P5 level
  - [[-1, 12], 1, Concat, [1]] # Concatenate head P5 features
  - [-1, 3, C2fCIB, [1024, True]] # Feature extraction using C3Ghost at P5 level (P5/32-large)

  # Detection layer to output results for each level (P3, P4, P5)
  - [[20, 24, 28], 1, v10Detect, [nc]] # Detect at different scales (P3, P4, P5)
