# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]         

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128]]
  - [-1, 1, CBAM, [256]]

  
  - [-1, 1, Focus, [3, 3, 1]] 
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 3, C2f, [256]]
  - [-1, 1, CoordAtt, [256]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsampling from P4 to P3
  - [-1, 1, Focus, [3, 3, 1]] 
  - [-1, 1, Conv, [512, 3, 2]] # 3-P3/8
  - [-1, 3, C2f, [512]]
  - [-1, 1, CoordAtt, [512]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsampling from P4 to P3


  

  - [-11, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 3, C2f, [256]]
  - [-1, 1, CBAM, [256]]
  
  - [-1, 1, Conv, [512, 3, 2]]  
  - [-1, 3, C2f, [512]]
  - [-1, 1, CBAM, [256]]


  - [-1, 1, Conv, [1024, 3, 2]] # P5/32
  - [-1, 3, C2fCIB, [1024, True, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  #- [-1, 1, EMA, [1024]]


head:
  # Applying SEBlock after C3Ghost for refining fine-grained features
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsampling from P5 to P4
  - [[-1, 18], 1, Concat, [1]] # Concatenate backbone P4 features
  - [-1, 1, C2f, [512]] # Applying SEBlock for fine-grained channel-wise recalibration at P4
  - [-1, 1, SEBlock, [256]] 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsampling from P4 to P3
  - [[-1, 8], 1, Concat, [1]] # Concatenate backbone P3 features
  - [-1, 3, C2f, [256]] # Feature extraction using C3Ghost at P3 level (P3/8-small)
  - [-1, 1, SEBlock, [128]] # Applying SEBlock for fine-grained channel-wise recalibration at P3

  - [-1, 1, Conv, [256, 3, 2]] # Downsample to P4 level
  - [[-1, 26], 1, Concat, [1]] # Concatenate head P4 features
  - [[-1, 13], 1, Concat, [1]] # Concatenate backbone P3 features
  - [-1, 3, C2f, [512]] # Feature extraction using C3Ghost at P4 level (P4/16-medium)
  - [-1, 1, SEBlock , [256]] # Applying EMA to emphasize prominent features at P4

  - [-1, 1, Conv, [512, 3, 2]] # Downsample to P5 level
  - [[-1, 22], 1, Concat, [1]] # Concatenate head P5 features
  - [-1, 3, C2fCIB, [1024]] # Feature extraction using C3Ghost at P5 level (P5/32-large)
  - [-1, 1, SEBlock, [512]] # Applying EMA to emphasize prominent features at P4

  # Detection layer to output results for each level (P3, P4, P5)
  - [[31, 36, 40], 1, v10Detect, [nc]] # Detect at different scales (P3, P4, P5)
