
  
# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]         
                                                             
# new mpodel to test with modified C2F FROM THE one that attended 0.784 and it has to adapt more different situations to adjust recall 
backbone:
  # [from, repeats, module, args]
  
 # - [-1, 1, Focus, [3, 3, 1]] 
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, CoordAtt, [128]]

  
  

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, LCAN, [256]]
  
  - [-1, 1, Conv, [512, 3, 2]]  
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, LCAN, [512]]


  - [-1, 1, Conv, [1024, 3, 2]] # P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, LCAN, [1024]] # Applying EMA to emphasize prominent features at P4

  
head:
  # Applying SEBlock after C3Ghost for refining fine-grained features
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsampling from P5 to P4
  - [[-1, 9], 1, Concat, [1]] # Concatenate backbone P4 features
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, CoordAtt , [256]] # Applying SEBlock for fine-grained channel-wise recalibration at P3


  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsampling from P4 to P3
  - [[-1, 6], 1, Concat, [1]] # Concatenate backbone P3 features
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, EMA , [128]] # Applying SEBlock for fine-grained channel-wise recalibration at P3

  - [-1, 1, Conv, [256, 3, 2]] # Downsample to P4 level
  - [[-1, 17], 1, Concat, [1]] # Concatenate head P4 features
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, CoordAtt , [256]] # Applying EMA to emphasize prominent features at P4

  - [-1, 1, Conv, [512, 3, 2]] # Downsample to P5 level
  - [[-1, 13], 1, Concat, [1]] # Concatenate head P5 features
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, EMA, [512]] # Applying EMA to emphasize prominent features at P4



  
  - [[21, 25, 29], 1, v10Detect, [nc]] # Detect at different scales (P3, P4, P5)
